# Casks
# all of these are auto-updating and not tracked by Homebrew;
# so this is for ease of installation

cask "raycast"
cask "alt-tab"
cask "rectangle"
cask "keycastr"
cask "stats"
cask "iterm2"
cask "google-chrome"
cask "spotify"
cask "obsidian"
cask "slack"
cask "zoom"
cask "todoist-app"
cask "visual-studio-code"
cask "cursor"
cask "docker-desktop"
cask "chatgpt"
cask "claude"
cask "jiggler" # doesn't auto update, but not released often

# zsh environment
brew "powerlevel10k"
brew "zsh-autosuggestions"
brew "zsh-fast-syntax-highlighting"

# File system utilities
brew "zoxide"   # modern autojump
brew "lsd"
brew "bat"
brew "stow"     # symlink management
brew "fzf"
brew "fd"       # better `find`
brew "ripgrep"  # better `grep`
brew "trash"

# Command-line utilities
brew "tmux"
brew "tealdeer"
brew "hwatch"
brew "hyperfine"
brew "wget"

# Resource usage
brew "btop"
brew "procs"
brew "bandwhich"
brew "ncdu"

# Programming: git, languages, package managers, containers
brew "gh"
brew "python"
brew "go"
brew "uv"
brew "fnm"
brew "docker"
brew "kubectl"

# Media
brew "ffmpeg"

# fun stuff :p
brew "cbonsai"
brew "cmatrix"
brew "cowsay"
brew "fortune"
brew "lolcat"